tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4439_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF4439_H_
#define _PIC18LF4439_H_

#define PORTA                         0
#define ULPWUIN                       1
#define AN0                           2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define VREFM                         8
#define AN3                           9
#define PORTA_RA3                     10
#define VREFP                         11
#define PORTA_RA4                     12
#define T0CKI                         13
#define AN4                           14
#define PORTA_RA5                     15
#define LVDIN                         16
#define SS                            17
#define PORTA_RA6                     18
#define OSC2                          19
#define CLK0                          20
#define PORTB                         21
#define PORTB_RB0                     22
#define INT0                          23
#define PORTB_RB1                     24
#define INT1                          25
#define INT2                          26
#define PORTB_RB2                     27
#define CCP2_PA2                      28
#define PORTB_RB3                     29
#define INT3                          30
#define PORTB_RB4                     31
#define PORTB_RB5                     32
#define PORTB_RB6                     33
#define PORTB_RB7                     34
#define PORTC                         35
#define T1CKI                         36
#define T1OSO                         37
#define PORTC_RC0                     38
#define PORTC_CCP2                    39
#define T1OSI                         40
#define PA2                           41
#define PORTC_RC1                     42
#define CCP1                          43
#define PA1                           44
#define PORTC_RC2                     45
#define SCL                           46
#define SCK                           47
#define PORTC_RC3                     48
#define SDA                           49
#define SDI                           50
#define PORTC_RC4                     51
#define SDO                           52
#define PORTC_RC5                     53
#define TX                            54
#define CK                            55
#define PORTC_RC6                     56
#define DT                            57
#define RX                            58
#define PORTC_RC7                     59
#define PORTD                         60
#define AD0                           61
#define PORTD_RD0                     62
#define PORTD_RD1                     63
#define AD1                           64
#define PORTD_RD2                     65
#define AD2                           66
#define PORTD_RD3                     67
#define AD3                           68
#define AD4                           69
#define PORTD_RD4                     70
#define PORTD_RD5                     71
#define AD5                           72
#define PORTD_RD6                     73
#define AD6                           74
#define PORTD_RD7                     75
#define SS2                           76
#define AD7                           77
#define PORTE                         78
#define AN5                           79
#define PD2                           80
#define RDE                           81
#define PORTE_RE0                     82
#define ALE                           83
#define AN6                           84
#define WRE                           85
#define PORTE_RE1                     86
#define PC2                           87
#define OE                            88
#define AN7                           89
#define CCP10                         90
#define PB2                           91
#define WRL                           92
#define CS                            93
#define PORTE_RE2                     94
#define CCP9E                         95
#define WRH                           96
#define PORTE_RE3                     97
#define PC3E                          98
#define PB3E                          99
#define PORTE_RE4                     100
#define CCP8E                         101
#define CCP7E                         102
#define PORTE_RE5                     103
#define PC1E                          104
#define CCP6E                         105
#define PORTE_RE6                     106
#define PB1E                          107
#define PORTE_CCP2                    108
#define CCP2E                         109
#define PA2E                          110
#define PORTE_RE7                     111
#define LATA                          112
#define LATA0                         113
#define LA0                           114
#define LATA1                         115
#define LA1                           116
#define LATA2                         117
#define LA2                           118
#define LATA3                         119
#define LA3                           120
#define LATA4                         121
#define LA4                           122
#define LATA5                         123
#define LA5                           124
#define LATA6                         125
#define LA6                           126
#define LATB                          127
#define LB0                           128
#define LATB0                         129
#define LB1                           130
#define LATB1                         131
#define LB2                           132
#define LATB2                         133
#define LB3                           134
#define LATB3                         135
#define LB4                           136
#define LATB4                         137
#define LB5                           138
#define LATB5                         139
#define LB6                           140
#define LATB6                         141
#define LB7                           142
#define LATB7                         143
#define LATC                          144
#define LATC0                         145
#define LC0                           146
#define LATC1                         147
#define LC1                           148
#define LATC2                         149
#define LC2                           150
#define LATC3                         151
#define LC3                           152
#define LATC4                         153
#define LC4                           154
#define LATC5                         155
#define LC5                           156
#define LATC6                         157
#define LC6                           158
#define LATC7                         159
#define LC7                           160
#define LATD                          161
#define LATD0                         162
#define LD0                           163
#define LATD1                         164
#define LD1                           165
#define LATD2                         166
#define LD2                           167
#define LATD3                         168
#define LD3                           169
#define LATD4                         170
#define LD4                           171
#define LATD5                         172
#define LD5                           173
#define LATD6                         174
#define LD6                           175
#define LATD7                         176
#define LD7                           177
#define LATE                          178
#define LATE0                         179
#define LE0                           180
#define LATE1                         181
#define LE1                           182
#define LATE2                         183
#define LE2                           184
#define LATE3                         185
#define LE3                           186
#define LATE4                         187
#define LE4                           188
#define LATE5                         189
#define LE5                           190
#define LATE6                         191
#define LE6                           192
#define LATE7                         193
#define LE7                           194
#define TRISA                         195
#define TRISA_RA0                     196
#define TRISA0                        197
#define TRISA_RA1                     198
#define TRISA1                        199
#define TRISA2                        200
#define TRISA_RA2                     201
#define TRISA_RA3                     202
#define TRISA3                        203
#define TRISA_RA4                     204
#define TRISA4                        205
#define TRISA_RA5                     206
#define TRISA5                        207
#define TRISA_RA6                     208
#define TRISA6                        209
#define RA7                           210
#define TRISB                         211
#define TRISB_RB0                     212
#define TRISB0                        213
#define TRISB_RB1                     214
#define TRISB1                        215
#define TRISB_RB2                     216
#define TRISB2                        217
#define TRISB_RB3                     218
#define TRISB3                        219
#define TRISB_RB4                     220
#define TRISB4                        221
#define TRISB_RB5                     222
#define TRISB5                        223
#define TRISB_RB6                     224
#define TRISB6                        225
#define TRISB_RB7                     226
#define TRISB7                        227
#define TRISC                         228
#define TRISC0                        229
#define TRISC_RC0                     230
#define TRISC_RC1                     231
#define TRISC_RC2                     232
#define TRISC3                        233
#define TRISC_RC3                     234
#define TRISC4                        235
#define TRISC_RC4                     236
#define TRISC5                        237
#define TRISC_RC5                     238
#define TRISC6                        239
#define TRISC_RC6                     240
#define TRISC7                        241
#define TRISC_RC7                     242
#define TRISD                         243
#define TRISD_RD0                     244
#define TRISD0                        245
#define TRISD_RD1                     246
#define TRISD1                        247
#define TRISD_RD2                     248
#define TRISD2                        249
#define TRISD_RD3                     250
#define TRISD3                        251
#define TRISD_RD4                     252
#define TRISD4                        253
#define TRISD_RD5                     254
#define TRISD5                        255
#define TRISD_RD6                     256
#define TRISD6                        257
#define TRISD_RD7                     258
#define TRISD7                        259
#define TRISE                         260
#define TRISE_RE0                     261
#define TRISE0                        262
#define TRISE_RE1                     263
#define TRISE1                        264
#define TRISE2                        265
#define TRISE_RE2                     266
#define TRISE_RE3                     267
#define TRISE_RE4                     268
#define PSPMODE                       269
#define TRISE_RE5                     270
#define IBOV                          271
#define OBF                           272
#define TRISE_RE6                     273
#define TRISE_RE7                     274
#define IBF                           275
#define PIE1                          276
#define TMR1IE                        277
#define TMR2IE                        278
#define CCP1IE                        279
#define SSPIE                         280
#define TXIE                          281
#define TX1IE                         282
#define RCIE                          283
#define RC1IE                         284
#define ADIE                          285
#define PSPIE                         286
#define PIR1                          287
#define TMR1IF                        288
#define TMR2IF                        289
#define CCP1IF                        290
#define SSPIF                         291
#define TXIF                          292
#define TX1IF                         293
#define RCIF                          294
#define RC1IF                         295
#define ADIF                          296
#define PSPIF                         297
#define IPR1                          298
#define TMR1IP                        299
#define TMR2IP                        300
#define CCP1IP                        301
#define SSPIP                         302
#define TX1IP                         303
#define TXIP                          304
#define RC1IP                         305
#define RCIP                          306
#define ADIP                          307
#define PSPIP                         308
#define PIE2                          309
#define CCP2IE                        310
#define TMR3IE                        311
#define LVDIE                         312
#define BCLIE                         313
#define EEIE                          314
#define PIR2                          315
#define CCP2IF                        316
#define TMR3IF                        317
#define LVDIF                         318
#define BCLIF                         319
#define EEIF                          320
#define IPR2                          321
#define CCP2IP                        322
#define TMR3IP                        323
#define LVDIP                         324
#define BCLIP                         325
#define EEIP                          326
#define EECON1                        327
#define RD                            328
#define WR                            329
#define WREN                          330
#define WRERR                         331
#define FREE                          332
#define CFGS                          333
#define EEFS                          334
#define EEPGD                         335
#define RCSTA                         336
#define RCD8                          337
#define RX9D                          338
#define OERR                          339
#define FERR                          340
#define ADDEN                         341
#define CREN                          342
#define SRENA                         343
#define SREN                          344
#define RC9                           345
#define RC8_9                         346
#define RX9                           347
#define SPEN                          348
#define TXSTA                         349
#define TXD8                          350
#define TX9D1                         351
#define TX9D                          352
#define TRMT                          353
#define TRMT1                         354
#define BRGH1                         355
#define BRGH                          356
#define SYNC                          357
#define SYNC1                         358
#define TXEN1                         359
#define TXEN                          360
#define TX91                          361
#define TX8_9                         362
#define TX9                           363
#define CSRC1                         364
#define CSRC                          365
#define T3CON                         366
#define TMR3ON                        367
#define TMR3CS                        368
#define nT3SYNC                       369
#define NOT_T3SYNC                    370
#define T3SYNC                        371
#define SOSCEN3                       372
#define T3CCP1                        373
#define T3CKPS                        374
#define T3CKPS0                       375
#define T3CKPS1                       376
#define T3CCP2                        377
#define T3CON_RD16                    378
#define RD163                         379
#define T3RD16                        380
#define CCP2CON                       381
#define CCP2M0                        382
#define CCP2M1                        383
#define CCP2M2                        384
#define CCP2M3                        385
#define DC2B0                         386
#define CCP2Y                         387
#define DC2B1                         388
#define DCCPX                         389
#define CCP2X                         390
#define CCP1CON                       391
#define CCP1M0                        392
#define CCP1M1                        393
#define CCP1M2                        394
#define CCP1M3                        395
#define CCP1Y                         396
#define DC1B0                         397
#define CCP1X                         398
#define DC1B1                         399
#define P1M0                          400
#define P1M1                          401
#define ADCON1                        402
#define PCFG0                         403
#define PCFG                          404
#define PCFG1                         405
#define PCFG2                         406
#define CHSN3                         407
#define PCFG3                         408
#define ADCS2                         409
#define ADFM                          410
#define ADCON0                        411
#define ADON                          412
#define nDONE                         413
#define GO_nDONE                      414
#define GO_DONE                       415
#define NOT_DONE                      416
#define GODONE                        417
#define DONE                          418
#define GO                            419
#define GO_NOT_DONE                   420
#define CHS                           421
#define CHS0                          422
#define CHS1                          423
#define CHS2                          424
#define ADCS                          425
#define ADCS0                         426
#define ADCAL                         427
#define ADCS1                         428
#define SSPCON2                       429
#define SEN                           430
#define RSEN                          431
#define PEN                           432
#define RCEN                          433
#define ACKEN                         434
#define ACKDT                         435
#define ACKSTAT                       436
#define GCEN                          437
#define SSPCON1                       438
#define SSPM0                         439
#define SSPM                          440
#define SSPM1                         441
#define SSPM2                         442
#define SSPM3                         443
#define CKP                           444
#define SSPEN                         445
#define SSPOV                         446
#define WCOL                          447
#define SSPSTAT                       448
#define BF                            449
#define UA                            450
#define R_NOT_W                       451
#define R_nW                          452
#define RW                            453
#define NOT_W                         454
#define R_W                           455
#define START                         456
#define S                             457
#define STOP                          458
#define P                             459
#define D_nA                          460
#define D_A                           461
#define DA                            462
#define D_NOT_A                       463
#define NOT_A                         464
#define CKE                           465
#define SMP                           466
#define T2CON                         467
#define T2CKPS0                       468
#define T2CKPS1                       469
#define TMR2ON                        470
#define TOUTPS0                       471
#define TOUTPS1                       472
#define TOUTPS2                       473
#define TOUTPS3                       474
#define PR2                           475
#define WM0                           476
#define WM1                           477
#define WAIT0                         478
#define WAIT1                         479
#define EBDIS                         480
#define T1CON                         481
#define TMR1ON                        482
#define TMR1CS                        483
#define NOT_T1SYNC                    484
#define T1SYNC                        485
#define nT1SYNC                       486
#define T1OSCEN                       487
#define SOSCEN                        488
#define T1CKPS0                       489
#define T1CKPS                        490
#define T1CKPS1                       491
#define T1CON_RD16                    492
#define T1RD16                        493
#define RCON                          494
#define BOR                           495
#define NOT_BOR                       496
#define nBOR                          497
#define POR                           498
#define nPOR                          499
#define NOT_POR                       500
#define nPD                           501
#define NOT_PD                        502
#define PD                            503
#define NOT_TO                        504
#define nTO                           505
#define TO                            506
#define nRI                           507
#define NOT_RI                        508
#define RI                            509
#define nIPEN                         510
#define IPEN                          511
#define NOT_IPEN                      512
#define WDTCON                        513
#define SWDTE                         514
#define SWDTEN                        515
#define LVDCON                        516
#define LVDL0                         517
#define LVDL                          518
#define LVDL1                         519
#define LVDL2                         520
#define LVDL3                         521
